{
  "MENU": {
    "HOME": "首頁",
    "INSTALLATION": "安裝",
    "OPERATORS": "運算式",
    "COMPANIES": "企業",
    "TEAM": "團隊"
  },
  "OPERATOR": {
    "PARAMETER": {
      "TITLE": "引數",
      "NAME": "名稱",
      "TYPE": "類型",
      "ATTRIBUTE": "屬性",
      "DESCRIPTION": "描述"
    },
    "ADDITIONAL_RESOURCES": {
      "TITLE": "其他資源",
      "SOURCE": "程式碼",
      "SPECS": "測試程式碼"
    },
    "EXAMPLES": {
      "TITLE": "範例"
    },
    "RELATED_OPERATORS": {
      "TITLE": "相關運算式"
    },
    "WALKTHROUGH": {
      "TITLE": "詳細解釋"
    },
    "NO_TRANSLATION": "翻譯尚未完成，請參閱英文版文件"
  },
  "HOME": {
    "TITLE": "Reactive Extensions Library for JavaScript",
    "GETSTARTED": "開始使用",
    "DESCRIPTION":
      "RxJS is a library for reactive programming using Observables, to make it easier to compose asynchronous or callback-based code. This project is a rewrite of Reactive-Extensions/RxJS with better performance, better modularity, better debuggable call stacks, while staying mostly backwards compatible, with some breaking changes that reduce the API surface",
    "INSTALL": {
      "TITLE": "安裝",
      "DESCRIPTION": " Find information on how to install RxJs from different sources from <i>npm </i>to<i> CDN</i>"
    },
    "LEARN": {
      "TITLE": "學習",
      "DESCRIPTION":
        "Read the full documentation on <i>Observables</i>, <i>Observer</i>, <i>Subject</i>, etc. In addition, View live examples alongside documentation with diagrams which helps you understand better in action"
    }
  },
  "INSTALLATION": {
    "TITLE": "安裝指南",
    "VIA": "透過",
    "INTRO": "下面是各種安裝 RxJs 的方式",
    "IMPORT": "To import the entire core set of functionality",
    "PATCHING": "To import only what you need by patching (this is useful for size-sensitive bundling)",
    "WITHBIND": "To import what you need and use it with proposed <a href=\"#/operators\">bind operator</a>:",
    "NOTE":
      "Note: This additional syntax requires transpiler support and this syntax may be completely withdrawn from TC39 without notice! Use at your own risk.",
    "ERROR":
      "If you receive an error like <code class=\"inline\">error TS2304: Cannot find name 'Promise' or error TS2304: Cannot find name 'Iterable'</code> when using RxJS you may need to install a supplemental set of typings.",
    "TYPINGUSERS": "For <span class=\"accent\">typings</span> users:",
    "NOTINTERFACE":
      "If you're not using typings the interfaces can be copied from <span class=\"accent\">/es6-shim/es6-shim.d.ts.</span>",
    "ADDTYPE": "Add type definition file included in <code class=\"inline\">tsconfig.json</code> or CLI argument.",
    "ALLMODULETYPES": "All Module Types",
    "VIAV3": "To install this library via npm version 3, use the following command",
    "VIAV2":
      "If you are using npm version 2 before this library has achieved a stable version, you need to specify the library version explicitly",
    "FORCDN": {
      "PART1": "For CDN, you can use.",
      "PART2": "Just replace version with the current version on the link below"
    },
    "FORBETA1": "針對 RxJS 5.0.0-beta.1 至 beta.11",
    "FORBETA12": "針對 RxJS 5.0.0-beta.12 或更高版本",
    "ADDITIONALRESOURCES": "其他資源",
    "OPERATORS": "運算式"
  }
}
